---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings
source: html/d6fd615f-0026-fb07-896b-0103d9a28376.htm
---
# CircuitNamingSchemeSettings Properties

The id of the assembly instance to which the element belongs.